Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-10-18.tmx
Source language: bo
Languages: en

source: མཉམ་པ་ཐམས་ཅད་ལ་མངོན་དུ་གྱུར་པའི་བཟོད་པ་རྣམ་པར་དག་པ་ལ་མོས་པའི་མཛོད་ལ་མཁས་པ་རང་བཞིན་གྱི་ཆོས་ལ་བཟོད་པ་ཁོང་དུ་ཆུད་པའི་ཡེ་ཤེས་མངོན་པར་ཤེས་པ་དང་ལྡན་པ།
en: He had mastered the treasury of aspiration for pure patience toward all that is heard. He had attained the definitive wisdom of patience for natural phenomena.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་རང་བཞིན་བསྒོམ་པ་དང་མི་འབྲལ་བའི་སེམས་དང་ལྡན་པ།
en: His mind was never apart from meditation on the nature of the bodhisattva conduct of higher cognition.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཤུགས་དྲག་པོ་ལས་ཕྱིར་མི་ལྡོག་པའི་སེམས་དང་ལྡན་པ།
en: His mind was irreversibly progressing toward the power of omniscience.

source: སྟོབས་བཅུའི་ཡེ་ཤེས་སྣང་བའི་འོད་རབ་ཏུ་ཐོབ་པ།
en: He had attained the illumination of the knowledge of the ten strengths.

source: ཆོས་ཀྱི་དབྱིངས་བརྗོད་པ་ལ་མངོན་པར་མོས་པས། ངོམས་པ་མེད་པའི་སེམས་དང་ལྡན་པ།
en: His mind was never content in its aspiration to hear the sound of the words of the realm of Dharma.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་རྣམ་པར་སྤྱོད་པའི་སྤྱོད་ཡུལ་ལ་འཇུག་པ་ཁོང་དུ་ཆུད་པའི་སེམས་དང་ལྡན་པ།
en: His mind had gained entry into the field of dwelling in omniscience.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་རྒྱན་མཐའ་ཡས་པ་མངོན་པར་བསྒྲུབ་པའི་སེམས་དང་ལྡན་པ།
en: His mind had attained the infinite display of bodhisattva conduct.

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་དཀྱིལ་འཁོར་མཐའ་ཡས་པ།
en: His mind was purified by the infinite domain of great bodhisattva prayers.

source: རྣམ་པར་སྤྱད་པའི་སེམས་དང་ལྡན་པ། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་དྲ་བ་མི་ཟད་པ། ཁོང་དུ་ཆུད་པའི་ཡེ་ཤེས་མཐའ་དང་དབུས་མེད་པ་མངོན་དུ་གྱུར་པའི་སེམས་དང་ལྡན་པ།
en: He had the mind with direct perception of the limitless knowledge without limit or center of the unceasing network of world realms.

source: སེམས་ཅན་རྒྱ་མཚོ་མཐའ་ཡས་པ་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བར་བྱ་བ་ལ་ཞུམ་པ་མེད་པའི་སེམས་དང་ལྡན་པ་དེས།
en: He had the mind that never wearies in ripening and guiding the infinite ocean of beings.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཡུལ་མཐའ་ཡས་པ་ལ་ཡང་དག་པར་བལྟ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་རྣམ་པ་ཐ་དད་པ་མཐའ་ཡས་པ་ལ་ཡང་དག་པར་བལྟ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་ཕྱེ་བ་སྣ་ཚོགས་མཐའ་ཡས་པ་ལ་ཡང་དག་པར་བལྟ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་པ་དམྱིགས་པ་ཕྲ་བ་དང་། ཡངས་པའི་ཁོངས་སུ་ཆུད་པར་བྱ་བ་ལ་ཡང་དག་པར་བལྟ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གཞི་མཐའ་ཡས་པའི་མིང་གི་དྲ་བ་སྣ་ཚོགས་ཡང་དག་པར་བལྟ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་སུ་རྣམ་པར་སྤྱད་པ།
en: He saw the infinite range of bodhisattva conduct. He saw the infinite diversity of the different world realms. He saw the small and the vast objects of perception included within the infinite world realms. He saw the various networks of names that are the bases for infinite world realms. He saw the various infinite, differing relative designations and terms for infinite world realms.

source: རྣམ་པར་གདགས་པ་མཐའ་ཡས་པའི་ཀུན་རྫོབ་རྣམ་པ་ཐ་དད་པ་ལ་ཡང་དག་པར་བལྟ་བ་དང་། སེམས་ཅན་གྱི་མོས་པ་སྣ་ཚོགས་མཐའ་ཡས་པ་ལ་ཡང་དག་པར་བལྟ་བ་དང་། སེམས་ཅན་རྣམ་པར་ཕྱེ་བའི་རྣམ་པ་ཐ་དད་པ།
en: He saw the infinite, differing aspirations of beings.

source: མཐའ་ཡས་པ་ལ་ཡང་དག་པར་བལྟ་བ་དང་། སེམས་ཅན་མཐའ་ཡས་པ་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བ་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཡང་དག་པར་བལྟ་བ་དང་། སེམས་ཅན་དང་ཕྱོགས་དང་དུས་མཐའ་ཡས་པའི་མྱིང་གི་རྣམ་པ་སྣ་ཚོགས་ལ་ཡང་དག་པར་བལྟ་བ་དང་། དགེ་བའི་བཤེས་གཉེན་མངོན་དུ་བྱ་བ་བྱེད་ཅིང་མཐར་གྱིས་ཡུལ་ཚོལ་བ་དང་ལྡན་པ་གང་ན་བ་དང་། བྲམ་ཟེ་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་ག་ལ་བ་དེར་ཕྱིན་ཏོ།
en: He saw the infinite, differing categories of beings. He saw the infinite practices for guiding and ripening beings. He saw the various infinite perceptions of the directions and times of beings. Focused on the kalyāṇamitra, Sudhana eventually arrived in the land called Īṣāṇa and went to where the brahmin Jayoṣmāyatana was.

source: །དེའི་ཚེ་བྲམ་ཟེ་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་ཐམས་ཅད་མཁྱེན་པ་ཉིད་བསྒྲུབ་པའི་གཞིར་བྱས་ཤིང་དཀའ་ཐུབ་དྲག་པོ་ལ་སྤྱོད་དེ།
en: At that time, the brahmin Jayoṣmāyatana was practicing the basis for accomplishing omniscience and practicing extreme asceticism.

source: དེའི་ཕྱོགས་བཞི་ནས་མེའི་ཕུང་པོ་རི་རབ་ཙམ་དུ་ཆེ་བ་བུས་པ་དང་། རི་ཤིན་ཏུ་མཐོ་བའི་གཡང་སའི་ལམ་གྱི་རྒྱུད་སྤུ་གྲིའི་སོས་གཤིབས་པས་འཁོད་པར་སྣང་ངོ་།
en: On all four sides of himself he had lit fires the size of mountains. Towering above was the precipice of a great mountain with a path of razors leading up it.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བྲམ་ཟེ་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། མདུན་དུ་འདུག་ནས་ཐལ་མོ་སྦྱར་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན།
en: Sudhana, the head merchant’s son, bowed his head to the feet of the brahmin Jayoṣmāyatana, sat down before him, and with his hands together in homage said, “Ārya, I have developed the aspiration for the highest, complete enlightenment.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་སྤྱད་པ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: How does a bodhisattva train in bodhisattva conduct? In what way does a bodhisattva practice it?

source: འཕགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་། རྗེས་སུ་བསྟན་པ་མཛད་དོ་ཞེས་བདག་གིས་ཐོས་ན།
en: Ārya, I have heard that you teach and give instructions to bodhisattvas.

source: འཕགས་པ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་བདག་ལ་བཤད་དུ་གསོལ་དེས་སྨྲས་པ་རིགས་ཀྱི་བུ་སོང་ལ་སྤུ་གྲིའི་སོ་དངར་བའི་རི་འདི་ལ་འཛེགས་ཏེ།
en: Therefore, Ārya, teach me how bodhisattvas train in bodhisattva conduct and in what way they practice it!” The brahmin Jayoṣmāyatana said, “Noble one, go and climb up this mountain on the path of razors and then jump down into this fire.

source: མེའི་འོབས་འདིར་མཆོངས་ཤིག་དང་། དེས་ཁྱོད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་དག་པར་འགྱུར་རོ་ཞེས་ནས།
en: In that way, your bodhisattva conduct will become pure.”

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ། མི་ཁོམ་པ་བརྒྱད་ལས་རྣམ་པར་ལྡོག་པ་ཡང་ཤིན་ཏུ་དཀོན།
en: Sudhana, the head merchant’s son, thought, “It is rare to avoid the eight unfavorable existences.

source: མྱིར་གྱུར་ཏེ་ཁོམ་པ་ཕུན་སུམ་ཚོགས་ཤིང་། རྣམ་པར་དག་པ་ཡང་ཤིན་ཏུ་དཀོན།
en: It is rare to become a human. It is rare to have pure good fortune.

source: སངས་རྒྱས་འབྱུང་བ་ཡང་ཤིན་ཏུ་དཀོན།
en: It is rare to have the appearance of a buddha.

source: དབང་པོ་ཉམས་པ་མྱེད་པ་ཡང་ཤིན་ཏུ་དཀོན།
en: It is rare to have unimpaired senses.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐོས་པ་ཡང་ཤིན་དུ་དཀོན།
en: It is rare to hear the Buddhadharma.

source: སྐྱེས་བུ་དམ་པ་དང་ཕྲད་པ་ཡང་ཤིན་ཏུ་དཀོན།
en: It is rare to meet a higher being.

source: ཡང་དག་པའི་དགེ་བའི་བཤེས་གཉེན་ཡང་ཤིན་ཏུ་དཀོན།
en: It is rare to have the friendship of a true kalyāṇamitra.

source: ཡང་དག་པའི་ཚུལ་རྗེས་སུ་བསྟན་པས་ལེགས་པར་སྡུད་པ་ཡང་ཤིན་ཏུ་དཀོན།
en: It is rare to gain the teaching of the true way.

source: ཡང་དག་པར་འཚོ་བར་བྱ་བ་ཡང་ཤིན་ཏུ་དཀོན།
en: It is rare to have a right livelihood.

source: མིའི་འཇིག་རྟེན་ན་ཆོས་དང་གཉེར་བའི་ཆོས་ལ་ནན་ཏན་བྱེད་པ་ཡང་ཤིན་ཏུ་དཀོན་ན།
en: It is rare in the human world to practice the Dharma and the ancillary Dharmas.

source: དེ་སྐད་ཟེར་ཞིང་བདག་གི་དགེ་བའི་བར་ཆད་ལ་ཞུགས་ལ་དེ་ལྟར་བདག་གི་སྲོག་གཅད་པར་བརྩོན་པ་འདི་བདུད་དམ་ཅིག་མ་ཡིན་ནམ།
en: “This person who will create an obstacle to my roots of merit, who urges me to kill myself, is he a māra?

source: བདུད་ཀྱི་བྱིན་གྱིས་བརླབས་པ་འམ།
en: Is he blessed by a māra?

source: བདུད་ཀྱི་རིས་སུ་གཏོགས་པའམ།
en: Is he a follower of Māra

source: དགེ་བའི་བཤེས་གཉེན་ལྟར་བརྫུས་པའམ།
en: Is he pretending to be a kalyāṇamitra?

source: བྱང་ཆུབ་སེམས་དཔའ་ལ་མྱི་གཅགས་པ་བྱེད་པ་ཞིག་མ་ཡིན་གྲང་།
en: Is he someone who destroys bodhisattvas?

source: བདག་གི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་བགེགས་བྱེད་པར་འདོད་པ་ཞིག་མ་ཡིན་གྲང་།
en: Does he wish to prevent me from attaining omniscience?

source: བདག་ལམ་གོལ་བ་ངན་པར་གཞུག་པར་འདོད་པ་ཞིག་མ་ཡིན་གྲང་།
en: Does he wish to lead me down a wrong path?

source: བདག་གིས་སངས་རྒྱས་ཀྱི་ཆོས་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ལ་བགེགས་བྱེད་པ་ཞིག་མ་ཡིན་གྲང་། སྙམ་ནས།
en: Is he creating an obstacle to the gateway of the Dharma through which one realizes the Buddhadharma?”

source: དེ་དེ་ལྟར་སེམས་ཤིང་ཡིད་ལ་བྱེད་པའི་ཚེ། ཚངས་པ་སྟོང་ཕྲག་བཅུ་སྟེང་གི་བར་སྣང་ལ་གནས་ཏེ། འདི་སྐད་ཅེས་འཛེར་ཏོ།
en: When Sudhana had these thoughts, ten thousand Brahmās who were up in the sky said to him, “Noble one, do not be unrelenting in these thoughts!

source: །རིགས་ཀྱི་བུ་དེ་ལྟ་བུའི་སེམས་མི་བརྟན་པར་མ་བྱེད་ཅིག །རིགས་ཀྱི་བུ་འཕགས་པ་འདི་ནི་ཏིང་ངེ་འཛིན་རྡོ་རྗེ་འོད་འཕྲོ་བའི་སྣང་བ་རབ་ཏུ་ཐོབ་པ་སྟེ།
en: This ārya has attained the illumination of the samādhi vajra light rays

source: བརྩོན་འགྲུས་ལྡོག་པ་མེད་པའོ།
en: He has unwavering diligence.

source: །བརྩམས་པ་ཆེན་པོ་མཐར་དབྱུང་བ་ལ་ཞུགས་པའོ།
en: He has set out on the greatest undertaking.

source: །འགྲོ་བ་ཐམས་ཅད་ཀྱི་སྲེད་པའི་རླན་བསྐམ་པ་ལ་མངོན་པར་བརྩོན་པའོ།
en: He is dedicated to drying up the moisture of craving in all beings.

source: །ལྟ་བའི་རྣམ་པ་དང་དྲ་བ་ཐམས་ཅད་གཏུབ་པ་ལ་བརྩོན་པའོ།
en: He is dedicated to cutting through the nets of wrong views.

source: །ཉོན་མོངས་པའི་ལྕག་ལྕིག་ཐམས་ཅད་ཟད་པར་བསྲེག་པ་ལ་སྟ་གོན་དུ་གནས་པའོ། །མི་ཁོམ་མི་ཤེས་པའི་བས་མཐའི་དགོན་པ་ཐམས་ཅད་སྣང་བར་བྱ་བ་ལ་བརྩོན་པའོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྒ་ཤིའི་གཡང་ས་དང་། འཇིགས་པ་རྣམ་པར་བཟློག་པ་ལ་ཡི་དམ་བརྟན་པའོ།
en: He is prepared to incinerate the forest of kleśas. He is dedicated to illuminating all the desolate areas of unfavorable knowledge. He has the resolute commitment to turn all beings away from the terror of the chasm of aging and death.

source: །དུས་གསུམ་གྱི་མུན་པ་བསལ་བ་ལ་མངོན་པར་བརྩོན་པའོ།
en: He is dedicated to dispelling the darkness in the three times.

source: །ཆོས་ཐམས་ཅད་ཀྱི་འོད་གཟེར་དགྱེ་བ་ལ་ཞུགས་པའོ།
en: He radiates the light rays of the entire Dharma.

source: །རིགས་ཀྱི་བུ་འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། ཚངས་པ་ཇི་སྙེད་ཅིག་མཁན་པོ་དང་དབང་བསྒྱུར་བ་དང་། འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་གཙོ་བོར་རང་རང་རློམ་ཞིང་སེམས་པ། ལྟ་བའི་རྣམ་པ་སྣ་ཚོགས་ལ་མངོན་པར་ཞེན་པ། དེ་དག་ཐམས་ཅད་འཕགས་པ་འདིའི་དཀའ་ཐུབ་དང་། བརྟུལ་ཞུགས་ཀྱི་ཐུགས་དམ་གྱི་མཐུས་རང་རང་གི་གནས་ན་བག་དགའ་བ་མེད་ཅིང་། དེ་དག་བསམ་གཏན་གྱི་རོ་དགའ་བ་མྱོང་བ་མེད་པས།
en: “Noble one, while this ārya was enduring the ascetic practice of the five heats, through the power of his commitment to asceticism and self-discipline, Brahmās who were accomplished and powerful, who arrogantly thought of themselves as preeminent in all worlds, and who were attached to a variety of incorrect views ceased to take pleasure in their state and no longer enjoyed the taste of their dhyāna, and they came into the presence of this ārya.

source: འཕགས་པ་འདིའི་དྲུང་དུ་འདོང་ངོ་། །དེ་དག་ཕྱིན་པ་དང་། འཕགས་པ་འདིའི་རྫུ་འཕྲུལ་གྱི་སྦྱིན་པ་དང་། དྲག་ཤུལ་གྱི་དཀའ་ཐུབ་དང་། བརྟུལ་ཞུགས་ཀྱི་ཟིལ་གྱིས་མནན་ཏེ། ལྟ་བའི་རྣམ་པ་ཐམས་ཅད་རྣམ་པར་བཟློག་པ་དང་། ང་རྒྱལ་དང་རློམ་སེམས་ཐམས་ཅད་རབ་ཏུ་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: When they had arrived, through the overpowering might of this ārya’s miracles and his fierce discipline and asceticism, they were all turned away from their wrong views, and he taught them the Dharma so that they would abandon all their pride and arrogance.

source: །འགྲོ་བ་ཐམས་ཅད་ལ་བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོས་ཁྱབ་པར་བྱ་བ་དང་། བྱང་ཆུབ་ཀྱི་བསམ་པ་བརྟན་པར་བྱ་བ་དང་། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ཤིན་ཏུ་ཡངས་པར་བྱ་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཡང་དག་པར་བལྟ་བ་ལ་མངོན་པར་བརྩོན་པར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་གསུང་གི་དཀྱིལ་འཁོར་ཐོབ་པར་བྱ་བ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་དང་། ཐམས་ཅད་དུ་གྲགས་པའི་སངས་རྒྱས་ཀྱི་དབྱངས་ལ་ཐོགས་པ་མེད་ཅིང་བསྒྲིབ་པ་མེད་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: He taught them the Dharma so that they would have great love and great compassion that spread over all beings, so that they would have an unwavering wish for enlightenment, so that they would develop a vast aspiration for enlightenment, so that they would be dedicated to seeing all the buddhas, so that they would have the complete attainment of the domain of the speech of the buddhas, and so that there would be everywhere without obscuration or impediment the sound of the voices of the buddhas.”

source: །བདུད་སྟོང་ཕྲག་བཅུ་ཡང་སྟེང་གི་བར་སྣང་ལ་འཁོད་ནས། ལྷ་རྫས་ཀྱི་ནོར་བུ་རིན་པོ་ཆེས་མངོན་པར་གཏོར་ཏེ།
en: Ten thousand māras were also in the sky above, scattering divine precious jewels.

source: འདི་སྐད་ཅེས་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། འོད་འཕྲོ་བའི་ཕུང་པོ་འདི་ལས་སྣང་བ་ཆེན་པོ་བྱུང་ཞིང་ཁོ་བོ་ཅག་གི་ཁྱིམ་དང་། ལུས་དང་རྒྱན་གྱི་ལོངས་སྤྱོད་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་ཏོ།
en: They said, “Noble one, while this ārya was enduring the ascetic practice of the five heats, from this mass of light rays came a great radiance that outshone all our residences, bodies, adornments, and possessions.

source: །དེའི་ཕྱིར་ཁོ་བོ་ཅག་ཀྱང་སོ་སོའི་གནས་གནས་ན་བག་དགའ་བ་མེད་པས་འཁོར་དང་བཅས་ཏེ་འཕགས་པ་འདིའི་དྲུང་དུ་འདོང་ངོ་། །ཁོ་བོ་ཅག་འདིའི་དྲུང་དུ་ཕྱིན་ནས་ཀྱང་།
en: Therefore, we too ceased to take pleasure in our residences, and with our entourages we came into the presence of this ārya.

source: འཕགས་པ་འདི་ནི་ཁོ་བོ་ཅག་ལ་ཅི་ནས་ཀྱང་རང་རང་གི་སེམས་སོར་ཆུད་ནས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཆོས་སྟོན་ཏོ།
en: When we had come before him, this ārya taught us the Dharma so that our minds were healed, we developed the aspiration for enlightenment, and we became irreversible on the way to the highest, complete enlightenment.”

source: དབང་བསྒྱུར་གྱི་ལྷའི་རྒྱལ་པོ། སྟོང་ཕྲག་བཅུས་ཀྱང་ལྷ་རྫས་ཀྱི་མེ་ཏོག་གིས་མངོན་པར་གཏོར་ཏེ།
en: Ten thousand Vaśavartin deva kings were also in the sky above, scattering divine flowers.

source: འདི་སྐད་ཅེས་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་བྱེད་པའི་ཚེ། ཁོ་བོ་ཅག་ཀྱང་རང་རང་གི་གནས་ན་དགའ་བ་མེད་དེ། དེ་ལྟར་བདག་ཅག་ཀྱང་རང་རང་གི་སྐྱེ་བོའི་འཁོར་དང་བཅས་ཏེ་འདིའི་དྲུང་དུ་འདོང་ངོ་།
en: They said, “Noble one, while this ārya was enduring the ascetic practice of the five heats, we also ceased to take delight in our residences, and therefore each of us, without entourages, came into the presence of this ārya.

source: །བདག་ཅག་འདིའི་དྲུང་དུ་ཕྱིན་པ་དང་འདི་ནི་བདག་ཅག་ལ་རང་རང་གི་སེམས་ལ་དབང་བསྒྱུར་བ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: When we came into his presence, he taught us the Dharma so that we gained control over our own minds.

source: །ཉོན་མོངས་པ་ཐམས་ཅད་ལ་དབང་བསྒྱུར་བ་ཐོབ་པར་བྱ་བ་དང་། བསམ་པ་ཇི་ལྟ་བཞིན་དུ་སྐྱེ་བ་ལ་དབང་བསྒྱུར་བ་ཐོབ་པར་བྱ་བ་དང་། ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་དག་པའི་དབང་རབ་ཏུ་ཐོབ་པར་བྱ་བ་དང་། སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ལ་དབང་རབ་ཏུ་ཐོབ་པར་བྱ་བ་དང་། ཡོ་བྱད་ལ་དབང་བའི་རྒྱན་ཡོངས་སུ་དག་པར་བྱ་བ་དང་། བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཚེ་ལ་དབང་བསྒྱུར་བ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: He taught us the Dharma so that we would have power over all kleśas, so that we would have the power to be reborn wherever we wish, so that we would have the power to purify the obscuration of karma, so that we would have power over all meditative states, so that we would have power over requisites, and so that we would have the power to live as long as we wish.”

source: །རབ་འཕྲུལ་དགའི་ལྷའི་རྒྱལ་པོ་སྟོང་ཕྲག་བཅུ་ཡང་སྟེང་གི་བར་སྣང་ལ་འཁོད་དེ། ལྷ་རྫས་ཀྱི་གླུ་ཡང་དག་པར་སྦྱར་བའི་ང་རོ་སྙན་པའི་དབྱངས་བསྒྲགས་ཏེ།
en: Ten thousand Sunirmita deva kings were also in the sky above, singing out a melodious roar of divine songs.

source: མཆོད་པ་བྱས་ནས་འདི་སྐད་ཅེས་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། མེའི་ཕུང་པོ་འདི་ལས་དེ་དང་འདྲ་བའི་འོད་བྱུང་ཞིང་དེས་ཁོ་བོ་ཅག་གི་གཞལ་མེད་ཁང་འདི་དག་རྣམ་པར་དག་སྟེ། གསལ་བ་དང་འོད་ཤིན་ཏུ་དང་བར་གྱུར་ཏོ།
en: They said, “Noble one, while this ārya was enduring the ascetic practice of the five heats there came from those masses of flames a corresponding light that purified, illuminated, and brightened our aerial palaces.

source: །རྒྱན་འདི་དང་ལྷའི་བུ་མོ་འདི་དག་ཀྱང་རྣམ་པར་དག་ཅིང་གསལ་ལ་འོད་ཤིན་དུ་དང་བར་གྱུར་ཏོ།
en: It also illuminated and brightened our adornments and our apsarases.

source: །དེ་བས་ན་བདག་ཅག་ཀྱང་ལྷའི་བུ་དང་ལྷ་མོའི་ཚོགས་ཀྱི་འཁོར་དང་བཅས་པར་འདོད་པ་ལ་དགའ་བར་ཚོར་བ་མེད་དོ།
en: Then we ceased to take delight in our entourage of young devas and apsarases.

source: །འདོད་པའི་བདེ་བ་ལ་མངོན་པར་དགའ་བ་མེད་པས་ལུས་དང་སེམས་ཚིམ་པར་གྱུར་ནས། འཕགས་པ་འདིའི་དྲུང་དུ་དོང་བ་ཡིན་ཏེ།
en: We ceased to delight in the bliss of desire, and our bodies and minds were left unsatisfied. We came into the presence of this ārya.

source: འཕགས་པ་འདི་ནི་བདག་ཅག་དེ་ལྟར་ཕྱིན་པ་རྣམས་ལ་སེམས་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: When we came into his presence, he taught us the Dharma so that our minds would be purified.

source: །སེམས་ཀྱི་འོད་འདང་བར་བྱ་བ་དང་། སེམས་ཤིན་དུ་དག་པར་བྱ་བ་དང་། སེམས་ལས་སུ་རུང་བར་བྱ་བ་དང་། སེམས་ཀྱི་དགའ་བ་ཡོངས་སུ་བསྐྱེད་པ་དང་། སྟོབས་བཅུའི་ཡེ་ཤེས་འཐོབ་པ་རྣམ་པར་དག་པར་བྱ་བ་དང་། ཆོས་ཀྱི་ཤུགས་ཆེན་པོ་རྣམ་པར་འཕེལ་བར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་སྐུ་ཚད་མེད་པ་མངོན་པར་བསྒྲུབ་པའི་ཕྱིར་ལུས་རྣམ་པར་དག་པར་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་གསུང་ཐོབ་པར་བྱ་བའི་ཕྱིར་ངག་རྣམ་པར་དག་པར་བྱ་བ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་རབ་ཏུ་ཐོབ་པར་བྱ་བར་སེམས་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: He taught us the Dharma so that our minds would be brightened, so that our minds would be very pure, so that our minds would be tractable, so that our minds would be joyful, so that we would have the pure attainment of the knowledge of the ten strengths, so as to increase the great power of the Dharma, so as to purify our bodies, so as to attain an immeasurable buddha body, so as to purify our speech, and so as to attain the voice of a buddha.”

source: །རབ་དགའ་ལྡན་གྱི་ལྷའི་རྒྱལ་པོ་སྟོང་ཕྲག་བཅུའི་ལྷའི་བུ་དང་། ལྷའི་བུ་མོའི་ཚོགས་ཀྱི་འཁོར་དང་བཅས་པ་དག་ཀྱང་སྟེང་གི་བར་སྣང་ལ་འཁོད་ནས། སྤོས་སྣ་ཚོགས་ཀྱི་ཕྱེ་མའི་སྤྲིན་གྱི་ཆར་མངོན་པར་ཕབ་པས་མཆོད་པ་བྱས་ཏེ།
en: Ten thousand Saṃtuṣita deva kings were also in the sky with an entourage of deva youths and apsarases, all of whom were paying homage and making an offering of sending down rain from clouds of various scented powders.

source: ཕྱག་འཚལ་ནས་འདི་སྐད་ཅེས་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། བདག་ཅག་ཀྱང་རང་རང་གི་གནས་ན་དགའ་བ་མེད་དེ།
en: They said, “Noble one, while this ārya was enduring the ascetic practice of the five heats, we ceased to take delight in our residences.

source: དེ་ལྟར་དགའ་བ་མེད་པས་འདིའི་དྲུང་དུ་འདོང་སྟེ།
en: As we had ceased to take delight in them, we came into the presence of this ārya.

source: བདག་ཅག་ཕྱིན་པ་རྣམས་ལ་འཕགས་པ་འདི་ནི་ཡུལ་ཐམས་ཅད་ལ་ལྟོས་པ་མེད་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: When we came into his presence, he taught us the Dharma so that we would not be dependent on any sensory object.

source: །ཆོག་ཤེས་པའི་སེམས་སུ་བྱ་བ་དང་། དགེ་བའི་རྩ་བ་ཡང་དག་པར་བསྐྱེད་པ་དང་། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་རབ་ཏུ་ཐོབ་པར་བྱ་བ་ནས། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: He taught us the Dharma so that our minds would have contentment, so that we would create the roots of merit, so that we would attain the development of the aspiration for enlightenment, and so that we would be able to fulfill the entire Buddhadharma.”

source: །རབ་མཚེ་མའི་ལྷའི་རྒྱལ་པོ་སྟོང་ཕྲག་བཅུ་ལྷའི་བུ་དང་། ལྷའི་བུ་མོའི་ཚོགས་ཀྱི་འཁོར་དང་བཅས་པ་དག་གིས་ཀྱང་ལྷ་རྫས་ཀྱི་མེ་ཏོག་མན་ད་ར་བའི་ཆར་མངོན་པར་ཕབ་སྟེ།
en: Ten thousand Suyāma deva kings were also in the sky with an entourage of deva youths and apsarases, all of whom were sending down a rain of divine coral tree flowers.

source: འདི་སྐད་ཅེས་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། བདག་ཅག་ཀྱང་ལྷ་རྫས་ཀྱི་གླུ་སྙན་པ་ལ་དགའ་བ་མེད་དེ།
en: They said, “Noble one, while this ārya was enduring the ascetic practice of the five heats, we ceased to take delight in listening to divine songs.

source: དེ་ལྟར་དགའ་བ་མེད་པས་འཕགས་པ་འདིའི་དྲུང་དུ་འདོང་སྟེ།
en: As we had ceased to take delight in them, we came into the presence of this ārya.

source: བདག་ཅག་ཕྱིན་ནས་ཀྱང་། འཕགས་པ་འདི་ནི་འདོད་པའི་དགའ་བ་ཐམས་ཅད་རྣམ་པར་བཟློག་པར་བྱ་བ་ནས། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: When we came into his presence, he taught us the Dharma so that we would turn away from all delight in desires and so that we would attain all of the Buddhadharma.”

source: །ལྷའི་དབང་པོ་བརྒྱ་བྱིན་སྟོང་ཕྲག་བཅུ་སོ་སོ་ནས། ཉེ་བའི་དབང་པོ་སུམ་ཅུ་རྩ་གཉིས་དང་། ལྷའི་བུ་དང་། ལྷའི་བུ་མོའི་ཚོགས་ཀྱི་འཁོར་དང་བཅས་པས།
en: Ten thousand Śakras, lords of devas, each with their thirty-two secondary lords and an entourage of deva youths and apsarases, were also in the sky.

source: ལྷ་རྫས་ཀྱི་གོས་དང་། རིན་པོ་ཆེའི་རྒྱན་དང་། མེ་ཏོག་གི་སྤྲིན་གྱི་ཆར་མངོན་པར་ཕབ་སྟེ།
en: They were dropping down rain from clouds of divine clothing, precious adornments, and flowers.

source: འདི་སྐད་ཅེས་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་འཕགས་པ་འདི། དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། བདག་ཅག་ཀྱང་བརྒྱ་བྱིན་གྱི་ཁང་པ་དང་། བཟའ་ཤིང་གི་ར་བ་དང་། རྩེ་བའི་ནགས་ཚལ་དང་། ལྷ་རྫས་ཀྱི་རོལ་མོ་བརྡུང་ཞིང་དཀྲོལ་བ་དང་། གམ་ཡོ་ན་གླུ་ལེན་པའི་ལོངས་སྤྱོད་ལ་དགའ་བ་མེད་དེ།
en: They said, “Noble one, when this ārya was enduring the ascetic practice of the five heats, we ceased to take delight in Śakra’s palace, park, pleasure groves, the playing of divine music, attendants, and songs.

source: དེ་ལྟར་བདག་ཅག་དགའ་བ་མེད་པས་འདིའི་དྲུང་དུ་འདོང་ངོ་།
en: As we had ceased to take delight in them, we came into the presence of this ārya.

source: །བདག་ཅག་དེར་ཕྱིན་ནས་ཀྱང་འཕགས་པ་འདི་ནི་ཁོ་བོ་ཅག་ལ་འདོད་པའི་དགའ་བ་ཐམས་ཅད་ཡོངས་སུ་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: When we came into his presence, he taught us the Dharma so that we would renounce all delight in desires.

source: །འདི་དག་ཐམས་ཅད་ནི་རྟག་པ་མ་ཡིན་ཏེ། མི་བརྟན་ཞིང་འཇིག་པར་འགྱུར་བའི་ཆོས་ཅན་ནོ་ཞེས་བྱ་བའི་ཚིག་བརྗོད་དོ། །དྲེགས་པ་དང་བག་མེད་པ་ཐམས་ཅད་ཡོངས་སུ་གཅད་པ་དང་། བླ་ན་མེད་པའི་བྱང་ཆུབ་ཏུ་སྤྲོ་བ་བསྐྱེད་པའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: He said, ‘All these have the qualities of being impermanent, unstable, and decaying.’ He taught us the Dharma so that our arrogance and carelessness would end and we would develop the aspiration for the highest enlightenment.

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་འདིས་བལྟས་པ་ཙམ་གྱིས་རི་རབ་ཀྱི་རྩེ་མོ་ཐམས་ཅད་ཀྱང་གཡོ་བར་འགྱུར་ཏེ།
en: “Moreover, noble one, just by his gaze these peaks of Meru are shaken.

source: དེས་བདག་ཅག་གཤིགས་པས་སེམས་སྐྱོ་བར་གྱུར་ནས། ཐམས་ཅད་མཁྱེན་པའི་སེམས་བརྟན་པས། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་སུ་སྨོན་ལམ་མངོན་པར་སྒྲུབ་བོ།
en: We became alarmed on being shaken, and as the omniscient mind cannot be disturbed, we made the prayer to attain omniscient wisdom.”

source: །ཀླུའི་རྒྱལ་པོ་ཤུགས་ལྡན་དང་། དགའ་བོ་དང་། བསྙེན་དགའ་བོ་ལ་སྩོགས་པ། ཀླུ་བརྒྱ་སྟོང་ཕྲག་བཅུ་དག་ཀྱང་སྟེང་གི་བར་སྣང་ལ་གནས་ཤིང་དུས་དང་མཐུན་པའི་ལྷ་རྫས་ཀྱི་ཙན་དན་གྱི་སྤྲིན་དང་། ཀླུའི་བུ་མོས་གླུ་བླངས་པའི་ང་རོ་སྙན་པའི་དབྱངས་དང་། ལྷ་རྫས་ཀྱི་སྤོས་ཆུའི་རྒྱུན་རབ་ཏུ་འབབ་པའི་ཆར་མངོན་པར་ཕབ་སྟེ།
en: Ten thousand nāgas such as the nāga kings Airāvata, Nanda, and Upananda were also in the sky above. They were sending down rain from clouds of divine yellow sandalwood, the pleasant sound of a chorus of nāga maidens, and rain that was a flow of divine scented water.

source: འདི་སྐད་ཅེས་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། མེའི་ཕུང་པོ་ཆེན་པོ་འདི་ལས་འོད་ཆེན་པོ་བྱུང་སྟེ། དེས་ཀླུའི་གནས་ཐམས་ཅད་སྣང་བར་བྱས་ནས། བྱེ་མའི་ཆར་དང་། ནམ་མཁའ་ལྡིང་གི་འཇིགས་པ་ཡོངས་སུ་སེལ་ཏོ།
en: They said, “Noble one, when this ārya was enduring the ascetic practice of the five heats, from this great fire shone a great light that illuminated all the dwellings of nāgas and eliminated the rains of sand and fear of the garuḍas.

source: །ཁྲོ་བ་འབྱུང་བ་ཡང་ཞི་བར་བྱས་ཏེ། ལུས་སིམ་པར་བྱས་ནས་ཡིད་ཤིན་ཏུ་མོས་པར་བྱེད་དོ། །དེ་ལྟར་སེམས་ཤིན་ཏུ་མོས་པར་གྱུར་ནས། འཕགས་པ་འདི་ནི་བདག་ཅག་ལ་ཆོས་སྟོན་ཏེ། འདི་ལྟར་ཀླུའི་ལམ་གྱི་རྒྱུད་ངན་པ་རྣམ་པར་སྨད་པ་དང་། སྒྲིབ་པའི་ལས་ཐམས་ཅད་རབ་ཏུ་སྤང་བའི་ཕྱིར་ཉེས་པ་འཆགས་སུ་བཙུད་ཅིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དུ་བཙུད་དེ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་རབ་ཏུ་དགོད་དོ།
en: It also pacified anger, refreshed our bodies, and made our minds serene. Then when we had serene minds, this ārya taught us the Dharma so that we would repudiate the evil ways of nāgas, renounce all karma that brings obscuration, confess transgressions, develop the aspiration for the highest, complete enlightenment, and be established in omniscience.”

source: །གནོད་སྦྱིན་གྱི་དབང་པོ་སྟོང་ཕྲག་བཅུ་ཡང་ནམ་མཁའི་དབྱིངས་ལ་འཁོད་དེ།
en: Ten thousand yakṣa lords were also in the sky above.
